In [1]:
import numpy as np
import pandas as pd

In [2]:
series = pd.Series([1, 2, 3, 4, 5, 6, 7], index=['A', 'B', 'C', 'D', 'E', 'F', 'G'])
df = pd.DataFrame({
    'Name': ['Alice Smith', 'Bob Johnson', 'Charlie Lee', 'David Brown', 'Eva White', 'Frank Black', 'Grace Green'],
    'Age': [28, 34, 29, 42, 23, 36, 30],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix', 'Philadelphia', 'San Antonio'],
    'Salary': [70000, 80000, 65000, 120000, 50000, 90000, 75000]
    },
    index=np.arange(1, 8))

In [3]:
df

          Name  Age          City  Salary
1  Alice Smith   28      New York   70000
2  Bob Johnson   34   Los Angeles   80000
3  Charlie Lee   29       Chicago   65000
4  David Brown   42       Houston  120000
5    Eva White   23       Phoenix   50000
6  Frank Black   36  Philadelphia   90000
7  Grace Green   30   San Antonio   75000

In [4]:
df['Name']

1    Alice Smith
2    Bob Johnson
3    Charlie Lee
4    David Brown
5      Eva White
6    Frank Black
7    Grace Green
Name: Name, dtype: object

In [10]:
df['Age']

1    28
2    34
3    29
4    42
5    23
6    36
7    30
Name: Age, dtype: int64

In [16]:
df[['Name', 'Salary']]

          Name  Salary
1  Alice Smith   70000
2  Bob Johnson   80000
3  Charlie Lee   65000
4  David Brown  120000
5    Eva White   50000
6  Frank Black   90000
7  Grace Green   75000

In [18]:
df

          Name  Age          City  Salary
1  Alice Smith   28      New York   70000
2  Bob Johnson   34   Los Angeles   80000
3  Charlie Lee   29       Chicago   65000
4  David Brown   42       Houston  120000
5    Eva White   23       Phoenix   50000
6  Frank Black   36  Philadelphia   90000
7  Grace Green   30   San Antonio   75000

In [17]:
df.loc[3]

Name      Charlie Lee
Age                29
City          Chicago
Salary          65000
Name: 3, dtype: object

In [19]:
df.loc[7]

Name      Grace Green
Age                30
City      San Antonio
Salary          75000
Name: 7, dtype: object

In [20]:
df.index = ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [21]:
df

          Name  Age          City  Salary
A  Alice Smith   28      New York   70000
B  Bob Johnson   34   Los Angeles   80000
C  Charlie Lee   29       Chicago   65000
D  David Brown   42       Houston  120000
E    Eva White   23       Phoenix   50000
F  Frank Black   36  Philadelphia   90000
G  Grace Green   30   San Antonio   75000

In [23]:
df.loc['E']

Name      Eva White
Age              23
City        Phoenix
Salary        50000
Name: E, dtype: object

In [30]:
df.iloc[4]

Name      Eva White
Age              23
City        Phoenix
Salary        50000
Name: E, dtype: object

In [31]:
df.loc['D':'G']

          Name  Age          City  Salary
D  David Brown   42       Houston  120000
E    Eva White   23       Phoenix   50000
F  Frank Black   36  Philadelphia   90000
G  Grace Green   30   San Antonio   75000

In [32]:
df.iloc[:3]

          Name  Age         City  Salary
A  Alice Smith   28     New York   70000
B  Bob Johnson   34  Los Angeles   80000
C  Charlie Lee   29      Chicago   65000

In [33]:
df

          Name  Age          City  Salary
A  Alice Smith   28      New York   70000
B  Bob Johnson   34   Los Angeles   80000
C  Charlie Lee   29       Chicago   65000
D  David Brown   42       Houston  120000
E    Eva White   23       Phoenix   50000
F  Frank Black   36  Philadelphia   90000
G  Grace Green   30   San Antonio   75000

In [38]:
df.loc['D'].Salary

np.int64(120000)

In [40]:
df['Salary'].loc['D']

np.int64(120000)

In [51]:
df[df['Age'] == df['Age'].min()]['Name']

E    Eva White
Name: Name, dtype: object

In [78]:
df[df['Salary'] == df['Salary'].max()]['Name']

D    David Brown
Name: Name, dtype: object

In [57]:
df

          Name  Age          City  Salary
A  Alice Smith   28      New York   70000
B  Bob Johnson   34   Los Angeles   80000
C  Charlie Lee   29       Chicago   65000
D  David Brown   42       Houston  120000
E    Eva White   23       Phoenix   50000
F  Frank Black   36  Philadelphia   90000
G  Grace Green   30   San Antonio   75000

In [69]:
sample_df = df.sample(n=3)
sample_df

          Name  Age     City  Salary
D  David Brown   42  Houston  120000
C  Charlie Lee   29  Chicago   65000
E    Eva White   23  Phoenix   50000

In [74]:
sample_df = df.sample(n=4, replace=True)
sample_df

          Name  Age          City  Salary
A  Alice Smith   28      New York   70000
E    Eva White   23       Phoenix   50000
F  Frank Black   36  Philadelphia   90000
E    Eva White   23       Phoenix   50000

In [75]:
df

          Name  Age          City  Salary
A  Alice Smith   28      New York   70000
B  Bob Johnson   34   Los Angeles   80000
C  Charlie Lee   29       Chicago   65000
D  David Brown   42       Houston  120000
E    Eva White   23       Phoenix   50000
F  Frank Black   36  Philadelphia   90000
G  Grace Green   30   San Antonio   75000

In [76]:
df.at['D', 'Age']

np.int64(42)

In [86]:
df.iat[5, 2]

'Philadelphia'

In [95]:
df[df['Age'] < 30]

          Name  Age      City  Salary
A  Alice Smith   28  New York   70000
C  Charlie Lee   29   Chicago   65000
E    Eva White   23   Phoenix   50000

In [108]:
df[(df['Age'] < 30) & (df['Salary'] >= 70000)]

          Name  Age      City  Salary
A  Alice Smith   28  New York   70000

In [115]:
mask = df['City'] == 'New York'
df.loc[mask]

          Name  Age      City  Salary
A  Alice Smith   28  New York   70000

In [120]:
df

          Name  Age          City  Salary
A  Alice Smith   28      New York   70000
B  Bob Johnson   34   Los Angeles   80000
C  Charlie Lee   29       Chicago   65000
D  David Brown   42       Houston  120000
E    Eva White   23       Phoenix   50000
F  Frank Black   36  Philadelphia   90000
G  Grace Green   30   San Antonio   75000

In [139]:
df[df.isin(['David', 34]).any(axis=1)]

          Name  Age         City  Salary
B  Bob Johnson   34  Los Angeles   80000

In [145]:
df[df.where(df['Age'] < 30).any(axis=1)]

          Name  Age      City  Salary
A  Alice Smith   28  New York   70000
C  Charlie Lee   29   Chicago   65000
E    Eva White   23   Phoenix   50000